unfdemo.BS_Billing/src/Catalogs/BS_НастройкиБиллинга/BS_НастройкиБиллинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BS_НастройкиБиллинга</name>
  <attributes>
    <name>Token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОблачногоСервиса</name>
    <type>
      <types>EnumRef.BS_ВидыОблачныхСервисов1С</types>
    </type>
  </attributes>
  <attributes>
    <name>Настройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщения</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
</mdclass:Catalog>

unfdemo.BS_Billing/src/InformationRegisters/BS_КонтрагнетыОблачногоСервиса/BS_КонтрагнетыОблачногоСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BS_КонтрагнетыОблачногоСервиса</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаБиллинга</name>
    <type>
      <types>CatalogRef.BS_НастройкиБиллинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

unfdemo.BS_Billing/src/Enums/BS_ВидыОблачныхСервисов1С/BS_ВидыОблачныхСервисов1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>BS_ВидыОблачныхСервисов1С</name>
  <enumValues>
    <name>ГотовоеРабочееМесто</name>
  </enumValues>
  <enumValues>
    <name>Фреш</name>
  </enumValues>
</mdclass:Enum>

unfdemo.BS_Billing/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d31edcfb-c254-4df6-813c-45d97556c9a4">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>bs_IDГРМ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6a614d71-f1bf-4633-927f-fd1ab375a540">
    <name>ВидКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbfd1e4e-302d-4158-a36e-7de2ee52275f">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="150ea83f-859a-4383-a7e2-add9615c515d">
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5466e60d-3f3b-4854-8bc4-fe713678faf2">
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a66e61d-1e1f-42eb-84c7-96c67491221a">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83abc3c8-5d30-4200-9b3c-c098e93d9dd4">
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2371825-a31d-415b-8866-8e1c4f108e47">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="578aaecc-aed2-4ef8-88f9-128a6e803783">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="854ddbe5-0bf2-4200-99b7-e7f1ddfc9a9f">
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="98a3a104-c023-42c2-a3c0-d21a8e8f0304">
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0565ba91-4e56-4a4c-9e27-ac8d883651da">
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="659f6c35-8c2c-4875-b5cb-8ac72af650b4">
    <name>ВидГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2539e2b6-2cb7-41c5-8e5d-9974cf014a38">
    <name>КодГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fd18fe57-8dac-4f41-ba14-ab79115be357">
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dbf75569-7170-46ea-98a4-29bb3969c1c2">
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7122d071-c81b-484d-974a-5395bce9e1e5">
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41b066d1-5b7a-43b3-a41f-e1454f08da07">
    <name>ДокументУдостоверяющийЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dcd64d96-d03a-453f-9b38-c9fb1774f698">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1fc7846e-c92e-4119-9b0b-ab25f1a6447b">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7abf59d6-06a4-45fa-b1d0-bf469f93bc01">
    <name>ДатаСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bffaa0c1-d082-4cef-bb60-629a5f7c83bf">
    <name>ИсточникПривлеченияПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c668625-cb13-4bde-bae0-9759ff1df43c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4bd3ecda-70e1-4a95-8164-e47939295eac">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec4ed95c-1f1d-4935-9318-2b9974ec88f0">
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80bc655a-d926-42fc-b027-e9e0c125aff4">
    <name>СтатьяДДСПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b164d06e-e560-4c9a-a490-fb1bec54fb76">
    <name>ВестиРасчетыПоДоговорам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e7689556-bfc3-41aa-a6c2-fae4e917afdd">
    <name>ВестиРасчетыПоДокументам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="76421bdf-3553-4920-b9b2-b9cca25e740f">
    <name>ВестиРасчетыПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd01f401-1241-4c4f-9e6d-5c8ef4ea683c">
    <name>ВестиУчетОплатыПоСчетам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89940d0d-bcf8-4eeb-bd2e-6d9d6b5110d0">
    <name>ВалютаРасчетовПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="289fa88c-0c40-46ed-a350-582ad572453e">
    <name>РасчетыВУсловныхЕдиницахПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f8460b3-4edc-494c-b668-547bba8b65f1">
    <name>СпособРазнесенияОплатыПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f23efb9-0af4-4fcc-879f-655e4106847d">
    <name>СпособЗачетаПредоплатыПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="adb6110c-e022-4572-88ef-65dd4952fcbe">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>bs_СервисыКлиента</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСервиса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

unfdemo.BS_Billing/src/Catalogs/BS_НастройкиБиллинга/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") Тогда
		НастройкаБиллинга = Параметры.Ключ;
		ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкаБиллинга);
		
		СохраненныеНастройки = НастройкаБиллинга.Настройки.Получить();
		
		Token = bs_РаботаСAPIВызовСервера.ПолучитьТокен(НастройкаБиллинга);
					
	УстановитьПривилегированныйРежим(Истина);		
			ИдентификаторРегламентногоЗадания 	= НастройкаБиллинга.ИдентификаторРегламентногоЗадания; 
			
			НайденноеРегламентноеЗадание = Неопределено;
			Если ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда			
				НайденноеРегламентноеЗадание = РегламентныеЗаданияСервер.Задание(ИдентификаторРегламентногоЗадания);
			КонецЕсли;			
		
			Если НайденноеРегламентноеЗадание 	= Неопределено Тогда
				ИдентификаторРегламентногоЗадания	= Неопределено;
				РасписаниеРегламентногоЗадания 		= Новый РасписаниеРегламентногоЗадания;
			Иначе
				РасписаниеРегламентногоЗадания 	= НайденноеРегламентноеЗадание.Расписание;
			КонецЕсли;		
	УстановитьПривилегированныйРежим(Ложь);
	Иначе
		ВидОблачногоСервиса = Перечисления.BS_ВидыОблачныхСервисов1С.ГотовоеРабочееМесто;
		Наименование = Строка(ВидОблачногоСервиса);
		
		СохраненныеНастройки = ПолучитьНастройкиПоУмолчанию();
	КонецЕсли;

	Если СохраненныеНастройки <> Неопределено Тогда	
		НастройкаДнейОповещенияКонтрагентов = СохраненныеНастройки.ДниОповещенияКонтрагентов;
		ДниОповещенийКонтрагентов.Загрузить(НастройкаДнейОповещенияКонтрагентов);
	КонецЕсли;

	ПараметрНастройкаБиллинга = Контрагенты.Параметры.Элементы.Найти("НастройкаБиллинга");
	ПараметрНастройкаБиллинга.Использование = Истина;
	ПараметрНастройкаБиллинга.Значение 		= НастройкаБиллинга;
	
	ОбновитьДниОповещенияКонтрагентов();
КонецПроцедуры

&НаКлиенте
Процедура TokenОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	Если НЕ СохранитьНастройки() Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	bs_РаботаСAPIВызовСервера.ЗаписатьНовыйТокен(НастройкаБиллинга, Текст);
	Token = bs_РаботаСAPIВызовСервера.ПолучитьТокен(НастройкаБиллинга);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьНадписьРасписанияОбмена();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И НЕ НужноЗакрытьОкно Тогда
		
		Отказ = Истина; 
		
		Если ЗавершениеРаботы Тогда 
			ТекстПредупреждения = "Настройки не будут сохранены. Закрыть?"; 
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗакрытииОкна", ЭтаФорма, Параметры);
			ПоказатьВопрос(Оповещение, "Настройки были изменены. Сохранить изменения перед закрытием?", РежимДиалогаВопрос.ДаНетОтмена, 0);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗакрытииОкна(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		НужноЗакрытьОкно = Истина;
		
		СохранитьНастройки(Истина);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		НужноЗакрытьОкно = Истина;
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СохранитьНастройки(ЗакрытьПоОкончании = Ложь)
	
	НастройкаСохранена = СохранитьНастройкуСервер();
	
	Если ЗакрытьПоОкончании Тогда Закрыть() КонецЕсли;
	
	Оповестить("СозданаИзмененаНастройка");
	
	Возврат НастройкаСохранена
	
КонецФункции  

&НаСервере
Функция СохранитьНастройкуСервер()
	
	Если Модифицированность ИЛИ НастройкаБиллинга.Пустая() Тогда
		
		Если НастройкаБиллинга.Пустая() Тогда
			ТекущийОбъект = Справочники.BS_НастройкиБиллинга.СоздатьЭлемент();
			ТекущийОбъект.Настройки = Новый ХранилищеЗначения(ПолучитьНастройкиПоУмолчанию());
		Иначе
			ТекущийОбъект = НастройкаБиллинга.ПолучитьОбъект();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТекущийОбъект, ЭтаФорма);
	
		НастройкиБиллинга = ТекущийОбъект.Настройки.Получить();
		НастройкиБиллинга.ДниОповещенияКонтрагентов = ДниОповещенийКонтрагентов.Выгрузить();

		ТекущийОбъект.Настройки = Новый ХранилищеЗначения(НастройкиБиллинга);

		ТекущийОбъект.Записать();
		НастройкаБиллинга = ТекущийОбъект.Ссылка;
		
УстановитьПривилегированныйРежим(Истина); //Для возможности всем пользователям с правами устанавливать расписания		
		Если РасписаниеРегламентногоЗадания <> Неопределено 
			И НЕ BS_ОбщегоНазначенияВызовСервераПовтИсп.БазаИспользуетсяВМоделиСервиса() Тогда
			
			ИменаИспользуемыхРеглЗаданий 	= BS_ОбщегоНазначенияВызовСервера.ПолучитьИменаИспользуемыхРеглЗаданий();
			СтруктураРеглЗаданий 			= BS_ОбщегоНазначенияВызовСервера.ПолучитьИспользуемыеРеглЗадания();

			ПараметрыЗапуска = Новый Массив();
			ПараметрыЗапуска.Добавить(СтруктураРеглЗаданий.Биллинг);
			ПараметрыЗапуска.Добавить(НастройкаБиллинга);
			
			Задание = РегламентныеЗаданияСервер.Задание(ИдентификаторРегламентногоЗадания);
			Если Задание <> Неопределено Тогда

				ПараметрыИзмененияЗадания = Новый Структура();
				ПараметрыИзмененияЗадания.Вставить("Использование", Истина);
				ПараметрыИзмененияЗадания.Вставить("Параметры", ПараметрыЗапуска);
				ПараметрыИзмененияЗадания.Вставить("Расписание", РасписаниеРегламентногоЗадания);
				ПараметрыИзмененияЗадания.Вставить("ИнтервалПовтораПриАварийномЗавершении", 0);
				ПараметрыИзмененияЗадания.Вставить("КоличествоПовторовПриАварийномЗавершении", 0);

				РегламентныеЗаданияСервер.ИзменитьЗадание(ИдентификаторРегламентногоЗадания, ПараметрыИзмененияЗадания);

			Иначе

				ПараметрыЗадания = Новый Структура();
				ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
				ПараметрыЗадания.Вставить("Наименование", ИменаИспользуемыхРеглЗаданий.Биллинг
					+ Наименование);
				ПараметрыЗадания.Вставить("Ключ", ИменаИспользуемыхРеглЗаданий.Биллинг
					+ Наименование);
				ПараметрыЗадания.Вставить("Использование", Истина);
				ПараметрыЗадания.Вставить("ЭксклюзивноеВыполнение", Ложь);
				ПараметрыЗадания.Вставить("Параметры", ПараметрыЗапуска);
				ПараметрыЗадания.Вставить("ИнтервалПовтораПриАварийномЗавершении", 0);
				ПараметрыЗадания.Вставить("КоличествоПовторовПриАварийномЗавершении", 0);
				ПараметрыЗадания.Вставить("Расписание", РасписаниеРегламентногоЗадания);

				Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
				Если ОбщегоНазначения.РазделениеВключено() Тогда
					//@skip-warning
					ИдентификаторРегламентногоЗадания = Задание.Идентификатор.УникальныйИдентификатор();
				Иначе
					ИдентификаторРегламентногоЗадания = Задание.УникальныйИдентификатор;
				КонецЕсли;

			КонецЕсли;

			Если Задание = Неопределено Тогда
				ИдентификаторРегламентногоЗадания = Неопределено;
			КонецЕсли;

		Иначе
			РегламентныеЗаданияСервер.УдалитьЗадание(ИдентификаторРегламентногоЗадания);
			ИдентификаторРегламентногоЗадания = Неопределено;
		КонецЕсли;		
	
УстановитьПривилегированныйРежим(Ложь);	
		
		ТекущийОбъект.ИдентификаторРегламентногоЗадания = ИдентификаторРегламентногоЗадания;				
		ТекущийОбъект.Записать();
		
		Модифицированность = Ложь;
			                                                           
	КонецЕсли;
	ОбновитьПовторноИспользуемыеЗначения();
	Возврат Истина
	
КонецФункции

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьНастройки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеБиллинга(Команда)
	
	Если РасписаниеРегламентногоЗадания = НеОпределено Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьИзменятьРасписание", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменятьРасписание(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = РасписаниеЗадания;
	
	УстановитьНадписьРасписанияОбмена();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКонрагентов(Команда)
	
	Если НЕ СохранитьНастройки() Тогда
		Возврат;
	КонецЕсли;
	
	
	Результат = bs_работаСAPIКлиент.ВызватьМетодAPIGET("/customers", Token);
	
	ОбработатьРезультатНаСервере(Результат);
	
	Элементы.Контрагенты.Обновить();
	
КонецПроцедуры
  
&НаСервере
Процедура ОбработатьРезультатНаСервере(Результат)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НастройкаБиллинга", НастройкаБиллинга);
	Запрос.Текст = "ВЫБРАТЬ
	|	BS_КонтрагнетыОблачногоСервиса.НастройкаБиллинга КАК НастройкаБиллинга,
	|	BS_КонтрагнетыОблачногоСервиса.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВремДанные
	|ИЗ
	|	РегистрСведений.BS_КонтрагнетыОблачногоСервиса КАК BS_КонтрагнетыОблачногоСервиса
	|ГДЕ
	|	BS_КонтрагнетыОблачногоСервиса.НастройкаБиллинга = &НастройкаБиллинга";
	Запрос.Выполнить();
	
	Для Каждого Строка из Результат Цикл
		
		Идентификатор = Строка.id;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Идентификатор", Строка.id);
		Запрос.Текст = "ВЫБРАТЬ
		|	ВремДанные.НастройкаБиллинга КАК НастройкаБиллинга,
		|	ВремДанные.Идентификатор КАК Идентификатор
		|ИЗ
		|	ВремДанные КАК ВремДанные
		|ГДЕ
		|	ВремДанные.Идентификатор = &Идентификатор";
		
		ВыполненныйЗапрос = Запрос.Выполнить();
		
		Если ВыполненныйЗапрос.Пустой() Тогда
			
			НоваяЗапись = РегистрыСведений.BS_КонтрагнетыОблачногоСервиса.СоздатьМенеджерЗаписи();
			НоваяЗапись.НастройкаБиллинга 	= НастройкаБиллинга;
			НоваяЗапись.Идентификатор 		= Идентификатор;
			НоваяЗапись.Наименование 		= Строка.name;
			НоваяЗапись.Контрагент 			= Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", Строка.inn);
			
			НоваяЗапись.Записать();
			
		Иначе      
			
			НоваяЗапись = РегистрыСведений.BS_КонтрагнетыОблачногоСервиса.СоздатьМенеджерЗаписи();
			НоваяЗапись.НастройкаБиллинга 	= НастройкаБиллинга;
			НоваяЗапись.Идентификатор 		= Идентификатор;
			НоваяЗапись.Прочитать();
			
			НоваяЗапись.Контрагент 			= Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", Строка.inn);
			НоваяЗапись.Наименование 		= Строка.name;
			
			НоваяЗапись.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область Прочие

&НаКлиенте
Процедура УстановитьНадписьРасписанияОбмена()
	
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		ТекстЗаголовка = НСтр("ru='Настроить расписание обмена'");
	Иначе
		ТекстЗаголовка = РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Элементы.НастроитьРасписаниеБиллинга.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиПоУмолчанию()
	Возврат Справочники.BS_НастройкиБиллинга.ПолучитьНастройкиПоУмолчанию();
КонецФункции

&НаСервере
Процедура ОбновитьДниОповещенияКонтрагентов()
	
	ДниОповещений = ПолучитьНастройкиПоУмолчанию().ДниОповещенияКонтрагентов;
	Если ДниОповещений.Количество() <> ДниОповещенийКонтрагентов.Количество() Тогда
		
		Для каждого Строка из ДниОповещенийКонтрагентов Цикл
			
			Если Строка.Пометка Тогда
				НайденнаяСрока = ДниОповещений.Найти(Строка.День);
				НайденнаяСрока.Пометка = Строка.Пометка;
			КонецЕсли;
			
		КонецЦикла;
		
		ДниОповещенийКонтрагентов.Очистить();
		ДниОповещенийКонтрагентов.Загрузить(ДниОповещений);
		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти
